cesanta/mongoose-os/libs/bt-common/src/esp32/esp32_bt_gatts.c
/*
 * Copyright (c) 2014-2018 Cesanta Software Limited
 * All rights reserved
 *
 * Licensed under the Apache License, Version 2.0 (the ""License"");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an ""AS IS"" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "mgos_bt_gatts.h"

#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>

#include "esp_bt.h"
#include "esp_bt_defs.h"
#include "esp_gap_ble_api.h"
#include "esp_gatt_common_api.h"
#include "esp_gatts_api.h"

#include "common/cs_dbg.h"
#include "common/mbuf.h"
#include "common/queue.h"

#include "mgos_hal.h"
#include "mgos_sys_config.h"

#include "esp32_bt_gap.h"
#include "esp32_bt_internal.h"

#ifndef MGOS_BT_GATTS_MAX_PREPARED_WRITE_LEN
#define MGOS_BT_GATTS_MAX_PREPARED_WRITE_LEN 4096
#endif

struct esp32_bt_service_attr_info;

struct esp32_bt_gatts_service_entry {
  const esp_gatts_attr_db_t *attr_db;
  const struct esp32_bt_service_attr_info *attr_info;
  uint16_t num_attrs;
  uint16_t num_cccds;
  enum mgos_bt_gatt_sec_level sec_level;
  bool registered;
  struct mgos_bt_uuid *uuids;
  SLIST_ENTRY(esp32_bt_gatts_service_entry) next;
};

struct esp32_bt_service_attr_info {
  uint16_t handle;
  uint8_t char_prop;
  mgos_bt_gatts_ev_handler_t handler;
  void *handler_arg;
};

struct esp32_bt_gatts_pending_write {
  uint16_t handle;
  struct mbuf value;
  SLIST_ENTRY(esp32_bt_gatts_pending_write) next;
};

struct esp32_bt_gatts_pending_ind {
  uint16_t handle;
  struct mg_str value;
  bool need_confirm;
  STAILQ_ENTRY(esp32_bt_gatts_pending_ind) next;
};

struct esp32_bt_gatts_connection_entry;

struct esp32_bt_gatts_session_entry {
  struct esp32_bt_gatts_connection_entry *ce;
  struct mgos_bt_gatts_conn gsc;
  struct esp32_bt_gatts_service_entry *se;
  uint16_t *cccd_values;
  SLIST_HEAD(pending_writes, esp32_bt_gatts_pending_write) pending_writes;
  SLIST_ENTRY(esp32_bt_gatts_session_entry) next;
};

struct esp32_bt_gatts_connection_entry {
  esp_gatt_if_t gatt_if;
  struct mgos_bt_gatt_conn gc;
  enum mgos_bt_gatt_sec_level sec_level;
  bool need_auth;
  bool ind_in_flight;
  /* Notifications/indications are finicky, so we keep at most one in flight. */
  int ind_queue_len;
  STAILQ_HEAD(pending_inds, esp32_bt_gatts_pending_ind) pending_inds;
  SLIST_HEAD(sessions, esp32_bt_gatts_session_entry) sessions;
  SLIST_ENTRY(esp32_bt_gatts_connection_entry) next;
};

struct esp32_bt_gatts_ev_info {
  esp_gatt_if_t gatts_if;
  esp_gatts_cb_event_t ev;
  esp_ble_gatts_cb_param_t ep;
};

static SLIST_HEAD(s_svcs, esp32_bt_gatts_service_entry) s_svcs =
    SLIST_HEAD_INITIALIZER(s_svcs);
static SLIST_HEAD(s_conns, esp32_bt_gatts_connection_entry) s_conns =
    SLIST_HEAD_INITIALIZER(s_conns);

static bool s_gatts_registered = false;
static esp_gatt_if_t s_gatts_if;

const uint16_t primary_service_uuid = ESP_GATT_UUID_PRI_SERVICE;
const uint16_t char_decl_uuid = ESP_GATT_UUID_CHAR_DECLARE;
const uint16_t char_client_config_uuid = ESP_GATT_UUID_CHAR_CLIENT_CONFIG;

static void esp32_bt_gatts_send_next_ind(
    struct esp32_bt_gatts_connection_entry *ce);
static void esp32_bt_gatts_create_sessions(
    struct esp32_bt_gatts_connection_entry *ce);
static void esp32_bt_gatts_send_resp(struct mgos_bt_gatts_conn *gsc,
                                     uint16_t handle, uint32_t trans_id,
                                     enum mgos_bt_gatt_status status);

esp_gatt_status_t esp32_bt_gatt_get_status(enum mgos_bt_gatt_status st) {
  switch (st) {
    case MGOS_BT_GATT_STATUS_OK:
      return ESP_GATT_OK;
    case MGOS_BT_GATT_STATUS_INVALID_HANDLE:
      return ESP_GATT_INVALID_HANDLE;
    case MGOS_BT_GATT_STATUS_READ_NOT_PERMITTED:
      return ESP_GATT_READ_NOT_PERMIT;
    case MGOS_BT_GATT_STATUS_WRITE_NOT_PERMITTED:
      return ESP_GATT_WRITE_NOT_PERMIT;
    case MGOS_BT_GATT_STATUS_INSUF_AUTHENTICATION:
      return ESP_GATT_INSUF_AUTHENTICATION;
    case MGOS_BT_GATT_STATUS_REQUEST_NOT_SUPPORTED:
      return ESP_GATT_REQ_NOT_SUPPORTED;
    case MGOS_BT_GATT_STATUS_INVALID_OFFSET:
      return ESP_GATT_INVALID_OFFSET;
    case MGOS_BT_GATT_STATUS_INSUF_AUTHORIZATION:
      return ESP_GATT_INSUF_AUTHORIZATION;
    case MGOS_BT_GATT_STATUS_INVALID_ATT_VAL_LENGTH:
      return ESP_GATT_INVALID_ATTR_LEN;
    case MGOS_BT_GATT_STATUS_UNLIKELY_ERROR:
      return ESP_GATT_ERR_UNLIKELY;
    case MGOS_BT_GATT_STATUS_INSUF_RESOURCES:
      return ESP_GATT_INSUF_RESOURCE;
  }
  return ESP_GATT_INTERNAL_ERROR;
}

static void esp32_bt_register_services(void) {
  struct esp32_bt_gatts_service_entry *se;
  if (!s_gatts_registered) return;
  SLIST_FOREACH(se, &s_svcs, next) {
    if (se->registered) continue;
    esp_err_t r = esp_ble_gatts_create_attr_tab(se->attr_db, s_gatts_if,
                                                se->num_attrs, 0);
    LOG(LL_DEBUG, ("esp_ble_gatts_create_attr_tab %p %d %d", se->attr_db,
                   se->num_attrs, r));
    se->registered = true;
  }
}

static struct esp32_bt_gatts_service_entry *find_service_by_uuid(
    const esp_bt_uuid_t *uuid) {
  struct esp32_bt_gatts_service_entry *se;
  SLIST_FOREACH(se, &s_svcs, next) {
    if (se->attr_db[0].att_desc.length == uuid->len &&
        memcmp(se->attr_db[0].att_desc.value, uuid->uuid.uuid128, uuid->len) ==
            0) {
      return se;
    }
  }
  return NULL;
}

static struct esp32_bt_gatts_service_entry *find_service_by_attr_handle(
    uint16_t attr_handle, int *ai) {
  struct esp32_bt_gatts_service_entry *se;
  SLIST_FOREACH(se, &s_svcs, next) {
    for (size_t i = 0; i < se->num_attrs; i++) {
      if (se->attr_info[i].handle == attr_handle) {
        if (ai != NULL) *ai = i;
        return se;
      }
    }
  }
  return NULL;
}

static struct esp32_bt_gatts_connection_entry *find_connection(
    esp_gatt_if_t gatt_if, uint16_t conn_id) {
  struct esp32_bt_gatts_connection_entry *ce = NULL;
  SLIST_FOREACH(ce, &s_conns, next) {
    if (ce->gatt_if == gatt_if && ce->gc.conn_id == conn_id) return ce;
  }
  return NULL;
}

static struct esp32_bt_gatts_session_entry *find_session(esp_gatt_if_t gatt_if,
                                                         uint16_t conn_id,
                                                         uint16_t handle,
                                                         int *ai) {
  struct esp32_bt_gatts_connection_entry *ce =
      find_connection(gatt_if, conn_id);
  if (ce == NULL) return NULL;
  struct esp32_bt_gatts_service_entry *se =
      find_service_by_attr_handle(handle, ai);
  if (se == NULL) return NULL;
  struct esp32_bt_gatts_session_entry *sse;
  SLIST_FOREACH(sse, &ce->sessions, next) {
    if (sse->se == se) return sse;
  }
  return NULL;
}

static bool is_paired(const esp_bd_addr_t addr) {
  bool result = false;
  int num = esp_ble_get_bond_device_num();
  esp_ble_bond_dev_t *list = (esp_ble_bond_dev_t *) calloc(num, sizeof(*list));
  if (list != NULL && esp_ble_get_bond_device_list(&num, list) == ESP_OK) {
    for (int i = 0; i < num; i++) {
      if (esp32_bt_addr_cmp(addr, list[i].bd_addr) == 0) {
        result = true;
        break;
      }
    }
  }
  free(list);
  return result;
}

