cesanta/mongoose-os/libs/bt-common/src/esp32/esp32_bt_gatts.c
static void esp32_bt_gatts_add_pending_write(
    struct esp32_bt_gatts_session_entry *sse, uint16_t handle,
    uint32_t trans_id, uint16_t offset, struct mg_str data, bool need_rsp) {
  struct esp32_bt_gatts_pending_write *pw = NULL;
  SLIST_FOREACH(pw, &sse->pending_writes, next) {
    if (pw->handle == handle) break;
  }
  if (pw == NULL) {
    pw = (struct esp32_bt_gatts_pending_write *) calloc(1, sizeof(*pw));
    pw->handle = handle;
    mbuf_init(&pw->value, data.len);
    SLIST_INSERT_HEAD(&sse->pending_writes, pw, next);
  }
  esp_gatt_status_t status = ESP_GATT_OK;
  esp_gatt_rsp_t rsp = {
      .attr_value.handle = handle,
      .attr_value.offset = offset,
      .attr_value.len = data.len,
      .attr_value.auth_req = ESP_GATT_AUTH_REQ_NONE,
  };
  if (offset != pw->value.len) {
    LOG(LL_ERROR, ("Invalid prepare write request: %u vs %u",
                   (unsigned int) pw->value.len, offset));
    status = ESP_GATT_INVALID_OFFSET;
  } else if (pw->value.len > MGOS_BT_GATTS_MAX_PREPARED_WRITE_LEN) {
    status = ESP_GATT_PREPARE_Q_FULL;
  } else {
    mbuf_append(&pw->value, data.p, data.len);
    memcpy(rsp.attr_value.value, data.p, data.len);
    LOG(LL_DEBUG, ("%d bytes pending for %u", (int) pw->value.len, pw->handle));
  }
  if (status != ESP_GATT_OK) {
    SLIST_REMOVE(&sse->pending_writes, pw, esp32_bt_gatts_pending_write, next);
    mbuf_free(&pw->value);
    free(pw);
  }
  if (need_rsp) {
    esp_ble_gatts_send_response(sse->ce->gatt_if, sse->ce->gc.conn_id, trans_id,
                                status, &rsp);
  }
}

static void esp32_dbe_to_uuid(const esp_gatts_attr_db_t *dbe,
                              struct mgos_bt_uuid *uuid) {
  uuid->len = dbe->att_desc.uuid_length;
  memcpy(&uuid->uuid, dbe->att_desc.uuid_p, uuid->len);
}

static bool is_cccd(const esp_gatts_attr_db_t *dbe) {
  return (dbe->att_desc.uuid_length == ESP_UUID_LEN_16 &&
          memcmp(dbe->att_desc.uuid_p, &char_client_config_uuid,
                 ESP_UUID_LEN_16) == 0);
}

static enum mgos_bt_gatt_status esp32_bt_gatts_call_handler(
    struct esp32_bt_gatts_session_entry *sse, int ai, enum mgos_bt_gatts_ev ev,
    void *ev_arg) {
  struct esp32_bt_gatts_service_entry *se = sse->se;
  /* Invoke attr handler if defined, otherwise fall back to service-wide
   * handler. */
  if (se->attr_info[ai].handler != NULL) {
    return se->attr_info[ai].handler(&sse->gsc, ev, ev_arg,
                                     se->attr_info[ai].handler_arg);
  } else {
    return se->attr_info[0].handler(&sse->gsc, ev, ev_arg,
                                    se->attr_info[0].handler_arg);
  }
}

static void esp32_bt_gatts_do_write(struct esp32_bt_gatts_session_entry *sse,
                                    uint16_t handle, uint32_t trans_id,
                                    uint16_t offset, struct mg_str data,
                                    bool need_rsp, bool prepared) {
  int ai;
  char buf[MGOS_BT_UUID_STR_LEN], buf2[MGOS_BT_UUID_STR_LEN];
  struct esp32_bt_gatts_service_entry *se = sse->se;
  for (ai = 0; ai < se->num_attrs; ai++) {
    if (se->attr_info[ai].handle == handle) break;
  }
  const esp_gatts_attr_db_t *dbe = &se->attr_db[ai];
  if (dbe == NULL) return;
  if (is_cccd(dbe)) {
    /* Write to client config descriptor - handle notification flag change. */
    if (offset != 0 || data.len != 2) {
      LOG(LL_ERROR, ("Invalid CCCD write request: %d bytes @ %d",
                     (int) data.len, (int) offset));
      esp32_bt_gatts_send_resp(&sse->gsc, handle, trans_id,
                               MGOS_BT_GATT_STATUS_REQUEST_NOT_SUPPORTED);
      return;
    }
    int ci = 0;
    /* Find the corresponding value. Can't fail since we found the session. */
    for (int i = 0; i < se->num_attrs; i++) {
      if (se->attr_info[i].handle == handle) break;
      if (is_cccd(&se->attr_db[i])) ci++;
    }
    ai--; /* Previous entry is the char value attr. */
    struct mgos_bt_gatts_notify_mode_arg arg = {
        .handle = se->attr_info[ai].handle,
    };
    switch (data.p[0]) {
      case 1:
        arg.mode = MGOS_BT_GATT_NOTIFY_MODE_NOTIFY;
        break;
      case 2:
        arg.mode = MGOS_BT_GATT_NOTIFY_MODE_INDICATE;
        break;
    }
    esp32_dbe_to_uuid(&se->attr_db[ai], &arg.uuid);
    enum mgos_bt_gatt_status st = esp32_bt_gatts_call_handler(
        sse, ai, MGOS_BT_GATTS_EV_NOTIFY_MODE, &arg);
    if (st == MGOS_BT_GATT_STATUS_OK) {
      memcpy(&sse->cccd_values[ci], data.p, 2);
    }
    LOG(LL_DEBUG, ("%s: notify mode %d st %d",
                   mgos_bt_uuid_to_str(&arg.uuid, buf), arg.mode, st));
    if (need_rsp) {
      esp32_bt_gatts_send_resp(&sse->gsc, handle, trans_id, st);
    }
    return;
  }
  struct mgos_bt_gatts_write_arg arg = {
      .trans_id = trans_id, .offset = offset, .data = data, .need_rsp = true,
  };
  esp32_dbe_to_uuid(dbe, &arg.uuid);
  LOG(LL_DEBUG,
      ("WRITE %s%s cid %d tid %u h %u (%s) off %d len %d",
       (prepared ? "(prepared) " : ""),
       mgos_bt_addr_to_str(&sse->gsc.gc.addr, 0, buf), sse->gsc.gc.conn_id,
       arg.trans_id, arg.handle, mgos_bt_uuid_to_str(&arg.uuid, buf2),
       arg.offset, (int) arg.data.len));
  enum mgos_bt_gatt_status st =
      esp32_bt_gatts_call_handler(sse, ai, MGOS_BT_GATTS_EV_WRITE, &arg);
  if (need_rsp) {
    esp32_bt_gatts_send_resp(&sse->gsc, handle, trans_id, st);
  }
}

/* Executed on the main task. */
static void esp32_bt_gatts_ev_mgos(void *arg) {
  char buf[MGOS_BT_UUID_STR_LEN], buf2[MGOS_BT_UUID_STR_LEN];
  struct esp32_bt_gatts_ev_info *ei = (struct esp32_bt_gatts_ev_info *) arg;
  switch (ei->ev) {
    case ESP_GATTS_CREAT_ATTR_TAB_EVT: {
      const struct gatts_add_attr_tab_evt_param *p = &ei->ep.add_attr_tab;
      struct esp32_bt_gatts_service_entry *se =
          find_service_by_uuid(&p->svc_uuid);
      if (se == NULL || se->num_attrs != p->num_handle) break;
      for (uint16_t i = 0; i < p->num_handle; i++) {
        ((struct esp32_bt_service_attr_info *) se->attr_info)[i].handle =
            p->handles[i];
      }
      uint16_t svch = se->attr_info[0].handle;
      LOG(LL_INFO,
          ("Starting BT service %s", esp32_bt_uuid_to_str(&p->svc_uuid, buf)));
      esp_ble_gatts_start_service(svch);
      free(ei->ep.add_attr_tab.handles);
      break;
    }
    case ESP_GATTS_CONNECT_EVT: {
      const struct gatts_connect_evt_param *p = &ei->ep.connect;
      bool disconnect = false;
      esp_ble_sec_act_t sec_act = 0;
      enum mgos_bt_gatt_sec_level sec_level = (enum mgos_bt_gatt_sec_level)
          mgos_sys_config_get_bt_gatts_min_sec_level();
      struct esp32_bt_gatts_service_entry *se;
      SLIST_FOREACH(se, &s_svcs, next) {
        if (se->sec_level > sec_level) sec_level = se->sec_level;
      }
      switch (sec_level) {
        case MGOS_BT_GATT_SEC_LEVEL_NONE:
          break;
        case MGOS_BT_GATT_SEC_LEVEL_AUTH:
        case MGOS_BT_GATT_SEC_LEVEL_ENCR:
          sec_act = ESP_BLE_SEC_ENCRYPT_NO_MITM;
          break;
        case MGOS_BT_GATT_SEC_LEVEL_ENCR_MITM:
          sec_act = ESP_BLE_SEC_ENCRYPT_MITM;
          break;
      }
      if (mgos_sys_config_get_bt_gatts_require_pairing()) {
        esp32_bt_addr_to_str(p->remote_bda, buf);
        int max_devices = mgos_sys_config_get_bt_max_paired_devices();
        if (is_paired(p->remote_bda)) {
          LOG(LL_INFO, ("%s: Already paired", buf));
        } else if (!mgos_bt_gap_get_pairing_enable()) {
          LOG(LL_ERROR, ("%s: pairing required but is not allowed", buf));
          disconnect = true;
        } else if (max_devices >= 0 &&
                   mgos_bt_gap_get_num_paired_devices() >= max_devices) {
          LOG(LL_ERROR,
              ("%s: pairing required but max num devices (%d) reached", buf,
               max_devices));
          disconnect = true;
        } else {
          LOG(LL_INFO, ("%s: Begin pairing", buf));
          if (sec_act == 0) sec_act = ESP_BLE_SEC_ENCRYPT_NO_MITM;
        }
      }
      if (disconnect) {
        LOG(LL_ERROR, ("%s: dropping connection",
                       esp32_bt_addr_to_str(p->remote_bda, buf)));
        esp_ble_gap_disconnect((uint8_t *) p->remote_bda);
        break;
      }
      struct esp32_bt_gatts_connection_entry *ce =
          (struct esp32_bt_gatts_connection_entry *) calloc(1, sizeof(*ce));
      ce->gatt_if = ei->gatts_if;
      ce->gc.conn_id = p->conn_id;
      ce->gc.mtu = ESP_GATT_DEF_BLE_MTU_SIZE;
      memcpy(ce->gc.addr.addr, p->remote_bda, ESP_BD_ADDR_LEN);
      STAILQ_INIT(&ce->pending_inds);
      SLIST_INSERT_HEAD(&s_conns, ce, next);
      if (sec_act != 0) {
        LOG(LL_DEBUG,
            ("%s: Requesting encryption%s",
             esp32_bt_addr_to_str(p->remote_bda, buf),
             (sec_act == ESP_BLE_SEC_ENCRYPT_MITM ? " + MITM protection"
                                                  : "")));
        esp_ble_set_encryption((uint8_t *) p->remote_bda, sec_act);
        ce->need_auth = true;
        /* Wait for AUTH_CMPL */
      } else {
        esp32_bt_gatts_create_sessions(ce);
      }
      break;
    }
    case ESP_GATTS_MTU_EVT: {
      struct gatts_mtu_evt_param *p = &ei->ep.mtu;
      struct esp32_bt_gatts_connection_entry *ce =
          find_connection(ei->gatts_if, p->conn_id);
      if (ce != NULL) {
        LOG(LL_DEBUG,
            ("%s: MTU %d", mgos_bt_addr_to_str(&ce->gc.addr, 0, buf), p->mtu));
        ce->gc.mtu = p->mtu;
        struct esp32_bt_gatts_session_entry *sse;
        SLIST_FOREACH(sse, &ce->sessions, next) {
          ((struct mgos_bt_gatt_conn *) &sse->gsc.gc)->mtu = p->mtu;
        }
      }
      break;
    }
    case ESP_GATTS_READ_EVT: {
      const struct gatts_read_evt_param *p = &ei->ep.read;
      int ai;
      struct esp32_bt_gatts_session_entry *sse =
          find_session(ei->gatts_if, p->conn_id, p->handle, &ai);
      if (sse == NULL) {
        esp_ble_gatts_send_response(ei->gatts_if, p->conn_id, p->trans_id,
                                    ESP_GATT_INVALID_HANDLE, NULL);
        break;
      }
      const esp_gatts_attr_db_t *dbe = &sse->se->attr_db[ai];
      if (is_cccd(dbe)) {
        /* Read of CCCD - send notification flag value. */
        struct esp32_bt_gatts_service_entry *se = sse->se;
        int ci = 0;
        /* Find the corresponding value. Can't fail since we found the session.
         */
        for (int i = 0; i < se->num_attrs; i++) {
          if (se->attr_info[i].handle == p->handle) break;
          if (is_cccd(&se->attr_db[i])) ci++;
        }
        esp_gatt_rsp_t rsp = {
            .attr_value =
                {
                 .handle = p->handle,
                 .offset = 0,
                 .len = 2,
                 .auth_req = ESP_GATT_AUTH_REQ_NONE,
                },
        };
        memcpy(rsp.attr_value.value, &sse->cccd_values[ci], 2);
        LOG(LL_DEBUG, ("ci %d 0x%04x", ci, sse->cccd_values[ci]));
        esp_ble_gatts_send_response(ei->gatts_if, p->conn_id, p->trans_id,
                                    ESP_GATT_OK, &rsp);
        break;
      }
      struct mgos_bt_gatts_write_arg arg = {
          .handle = p->handle, .trans_id = p->trans_id, .offset = p->offset,
      };
      esp32_dbe_to_uuid(dbe, &arg.uuid);
      LOG(LL_DEBUG, ("READ %s cid %d tid %u h %u (%s) off %d",
                     mgos_bt_addr_to_str(&sse->gsc.gc.addr, 0, buf),
                     sse->gsc.gc.conn_id, arg.trans_id, arg.handle,
                     mgos_bt_uuid_to_str(&arg.uuid, buf2), arg.offset));
      enum mgos_bt_gatt_status st =
          esp32_bt_gatts_call_handler(sse, ai, MGOS_BT_GATTS_EV_READ, &arg);
      if (st != MGOS_BT_GATT_STATUS_OK && p->need_rsp) {
        esp32_bt_gatts_send_resp(&sse->gsc, p->handle, p->trans_id, st);
      }
      break;
    }
    case ESP_GATTS_WRITE_EVT: {
      const struct gatts_write_evt_param *p = &ei->ep.write;
      struct esp32_bt_gatts_session_entry *sse =
          find_session(ei->gatts_if, p->conn_id, p->handle, NULL);
      if (sse != NULL) {
        struct mg_str data = MG_MK_STR_N((char *) p->value, p->len);
        if (p->is_prep) {
          esp32_bt_gatts_add_pending_write(sse, p->handle, p->trans_id,
                                           p->offset, data, p->need_rsp);
        } else {
          esp32_bt_gatts_do_write(sse, p->handle, p->trans_id, p->offset, data,
                                  p->need_rsp, false);
        }
      } else {
        esp_ble_gatts_send_response(ei->gatts_if, p->conn_id, p->trans_id,
                                    ESP_GATT_INVALID_HANDLE, NULL);
      }
      free(ei->ep.write.value);
      break;
    }
    case ESP_GATTS_EXEC_WRITE_EVT: {
      const struct gatts_exec_write_evt_param *p = &ei->ep.exec_write;
      struct esp32_bt_gatts_connection_entry *ce =
          find_connection(ei->gatts_if, p->conn_id);
      if (ce == NULL) break;
      struct esp32_bt_gatts_session_entry *sse;
      SLIST_FOREACH(sse, &ce->sessions, next) {
        struct esp32_bt_gatts_pending_write *pw, *pwt;
        SLIST_FOREACH_SAFE(pw, &sse->pending_writes, next, pwt) {
          SLIST_REMOVE(&sse->pending_writes, pw, esp32_bt_gatts_pending_write,
                       next);
          if (p->exec_write_flag == ESP_GATT_PREP_WRITE_EXEC) {
            esp32_bt_gatts_do_write(sse, pw->handle, p->trans_id, 0,
                                    mg_mk_str_n(pw->value.buf, pw->value.len),
                                    true /* need_rsp */, true /* is_prep */);

          } else {
            /* Must be cancel - do nothing, simply discard the write. */
          }
          mbuf_free(&pw->value);
          memset(pw, 0, sizeof(*pw));
          free(pw);
        }
      }
      break;
    }
    case ESP_GATTS_DISCONNECT_EVT: {
      const struct gatts_disconnect_evt_param *p = &ei->ep.disconnect;
      struct esp32_bt_gatts_connection_entry *ce =
          find_connection(ei->gatts_if, p->conn_id);
      if (ce == NULL) break;
      struct esp32_bt_gatts_session_entry *sse, *sset;
      SLIST_FOREACH_SAFE(sse, &ce->sessions, next, sset) {
        struct esp32_bt_gatts_pending_write *pw, *pwt;
        SLIST_FOREACH_SAFE(pw, &sse->pending_writes, next, pwt) {
          mbuf_free(&pw->value);
          memset(pw, 0, sizeof(*pw));
          free(pw);
        }
        esp32_bt_gatts_call_handler(sse, 0, MGOS_BT_GATTS_EV_DISCONNECT, NULL);
        free(sse->cccd_values);
        free(sse);
      }
      struct esp32_bt_gatts_pending_ind *pi, *pit;
      STAILQ_FOREACH_SAFE(pi, &ce->pending_inds, next, pit) {
        free((void *) pi->value.p);
        memset(pi, 0, sizeof(*pi));
        free(pi);
      }
      SLIST_REMOVE(&s_conns, ce, esp32_bt_gatts_connection_entry, next);
      free(ce);
      break;
    }
    case ESP_GATTS_CONF_EVT: {
      const struct gatts_conf_evt_param *p = &ei->ep.conf;
      struct esp32_bt_gatts_connection_entry *ce =
          find_connection(ei->gatts_if, p->conn_id);
      if (ce == NULL) break;
      ce->ind_in_flight = false;
      if (!STAILQ_EMPTY(&ce->pending_inds)) {
        struct esp32_bt_gatts_pending_ind *pi = STAILQ_FIRST(&ce->pending_inds);
        STAILQ_REMOVE_HEAD(&ce->pending_inds, next);
        ce->ind_queue_len--;
        /*
         * NB: p->handle is invalid for indications.
         * https://github.com/espressif/esp-idf/issues/2838
         */
        int ai;
        struct esp32_bt_gatts_session_entry *sse =
            find_session(ei->gatts_if, p->conn_id, pi->handle, &ai);
        if (sse != NULL) {
          struct mgos_bt_gatts_ind_confirm_arg arg = {
              .handle = pi->handle, .ok = (p->status == ESP_GATT_OK),
          };
          esp32_bt_gatts_call_handler(sse, ai, MGOS_BT_GATTS_EV_IND_CONFIRM,
                                      &arg);
        }
        free((void *) pi->value.p);
        memset(pi, 0, sizeof(*pi));
        free(pi);
      }
      esp32_bt_gatts_send_next_ind(ce);
      break;
    }
    default:
      break;
  }
  memset(ei, 0, sizeof(*ei));
  free(ei);
};

static void run_on_mgos_task(esp_gatt_if_t gatts_if, esp_gatts_cb_event_t ev,
                             esp_ble_gatts_cb_param_t *ep) {
  struct esp32_bt_gatts_ev_info *ei =
      (struct esp32_bt_gatts_ev_info *) calloc(1, sizeof(*ei));
  ei->gatts_if = gatts_if;
  ei->ev = ev;
  memcpy(&ei->ep, ep, sizeof(ei->ep));
  switch (ei->ev) {
    case ESP_GATTS_CREAT_ATTR_TAB_EVT: {
      /* Make a copy of handles */
      size_t len =
          ep->add_attr_tab.num_handle * sizeof(*ep->add_attr_tab.handles);
      uint16_t *handles_copy = (uint16_t *) malloc(len);
      memcpy(handles_copy, ep->add_attr_tab.handles, len);
      ei->ep.add_attr_tab.handles = handles_copy;
      break;
    }
    case ESP_GATTS_WRITE_EVT: {
      /* Make a copy of the value */
      uint8_t *value_copy = (uint8_t *) malloc(ep->write.len);
      memcpy(value_copy, ep->write.value, ep->write.len);
      ei->ep.write.value = value_copy;
      break;
    }
    default:
      break;
  }
  mgos_invoke_cb(esp32_bt_gatts_ev_mgos, ei, false /* from_isr */);
}

static void esp32_bt_gatts_create_sessions(
    struct esp32_bt_gatts_connection_entry *ce) {
  /* Create a session for each of the currently registered services. */
  struct esp32_bt_gatts_service_entry *se;
  esp_ble_gatts_cb_param_t ep;
  ep.connect.conn_id = ce->gc.conn_id;
  memcpy(ep.connect.remote_bda, ce->gc.addr.addr, ESP_BD_ADDR_LEN);
  SLIST_FOREACH(se, &s_svcs, next) {
    struct esp32_bt_gatts_session_entry *sse =
        (struct esp32_bt_gatts_session_entry *) calloc(1, sizeof(*sse));
    sse->ce = ce;
    sse->se = se;
    memcpy((void *) &sse->gsc.gc, &ce->gc, sizeof(sse->gsc.gc));
    ;
    SLIST_INIT(&sse->pending_writes);
    enum mgos_bt_gatt_status st =
        esp32_bt_gatts_call_handler(sse, 0, MGOS_BT_GATTS_EV_CONNECT, NULL);
    if (st != MGOS_BT_GATT_STATUS_OK) {
      /* Service rejected the connection, do not create session for it. */
      free(sse);
      continue;
    }
    sse->cccd_values = calloc(sse->se->num_cccds, sizeof(*sse->cccd_values));
    SLIST_INSERT_HEAD(&ce->sessions, sse, next);
  }
  esp_ble_conn_update_params_t conn_params = {0};
  memcpy(conn_params.bda, ce->gc.addr.addr, ESP_BD_ADDR_LEN);
  conn_params.latency = 0;
  conn_params.max_int = 0x50; /* max_int = 0x50*1.25ms = 100ms */
  conn_params.min_int = 0x30; /* min_int = 0x30*1.25ms = 60ms */
  conn_params.timeout = 400;  /* timeout = 400*10ms = 4000ms */
  esp_ble_gap_update_conn_params(&conn_params);
}

struct auth_cmpl_info {
  esp_bd_addr_t addr;
  bool success;
};

