cesanta/mongoose-os/libs/bt-common/src/esp32/esp32_bt_gatts.c
static void esp32_bt_gatts_send_next_ind(
    struct esp32_bt_gatts_connection_entry *ce) {
  if (ce->ind_in_flight) return;
  if (STAILQ_EMPTY(&ce->pending_inds)) return;
  struct esp32_bt_gatts_pending_ind *pi = STAILQ_FIRST(&ce->pending_inds);
  ce->ind_in_flight = true;
  if (esp_ble_gatts_send_indicate(ce->gatt_if, ce->gc.conn_id, pi->handle,
                                  pi->value.len, (uint8_t *) pi->value.p,
                                  pi->need_confirm) == ESP_OK) {
  } else {
    ce->ind_in_flight = false;
  }
}

bool mgos_bt_gatts_disconnect(struct mgos_bt_gatts_conn *gsc) {
  if (gsc == NULL) return false;
  return esp_ble_gatts_close(s_gatts_if, gsc->gc.conn_id) == ESP_OK;
}

static uint16_t get_read_perm(enum mgos_bt_gatt_sec_level sec_level) {
  if (mgos_sys_config_get_bt_gatts_min_sec_level() > sec_level) {
    sec_level = mgos_sys_config_get_bt_gatts_min_sec_level();
  }
  uint16_t res = ESP_GATT_PERM_READ;
  switch (sec_level) {
    case MGOS_BT_GATT_SEC_LEVEL_NONE:
      break;
    case MGOS_BT_GATT_SEC_LEVEL_AUTH:
    case MGOS_BT_GATT_SEC_LEVEL_ENCR:
      res = ESP_GATT_PERM_READ_ENCRYPTED;
      break;
    case MGOS_BT_GATT_SEC_LEVEL_ENCR_MITM:
      res = ESP_GATT_PERM_READ_ENC_MITM;
      break;
  }
  return res;
}

static uint16_t get_write_perm(enum mgos_bt_gatt_sec_level sec_level) {
  if (mgos_sys_config_get_bt_gatts_min_sec_level() > sec_level) {
    sec_level = mgos_sys_config_get_bt_gatts_min_sec_level();
  }
  uint16_t res = ESP_GATT_PERM_WRITE;
  switch (sec_level) {
    case MGOS_BT_GATT_SEC_LEVEL_NONE:
      break;
    case MGOS_BT_GATT_SEC_LEVEL_AUTH:
    case MGOS_BT_GATT_SEC_LEVEL_ENCR:
      res = ESP_GATT_PERM_WRITE_ENCRYPTED;
      break;
    case MGOS_BT_GATT_SEC_LEVEL_ENCR_MITM:
      res = ESP_GATT_PERM_WRITE_ENC_MITM;
      break;
  }
  return res;
}

bool mgos_bt_gatts_register_service(const char *svc_uuid,
                                    enum mgos_bt_gatt_sec_level sec_level,
                                    const struct mgos_bt_gatts_char_def *chars,
                                    mgos_bt_gatts_ev_handler_t handler,
                                    void *handler_arg) {
  bool res = false;
  uint16_t na = 0, nu = 0;
  struct esp32_bt_gatts_service_entry *se =
      (struct esp32_bt_gatts_service_entry *) calloc(1, sizeof(*se));
  if (se == NULL) goto out;
  const struct mgos_bt_gatts_char_def *cd;
  /* Count number of attrs and UUIDs required. */
  na = nu = 1;  // svc decl
  for (cd = chars; cd->uuid != NULL; cd++) {
    nu++;
    na += 2;
    if (cd->prop & (MGOS_BT_GATT_PROP_NOTIFY | MGOS_BT_GATT_PROP_INDICATE)) {
      na++;  // CCCD
    }
  }
  esp_gatts_attr_db_t *db = (esp_gatts_attr_db_t *) calloc(na, sizeof(*db));
  esp_gatts_attr_db_t *dbe = db;
  struct mgos_bt_uuid *uuids =
      (struct mgos_bt_uuid *) calloc(nu, sizeof(*uuids));
  struct mgos_bt_uuid *uuid = uuids;
  struct esp32_bt_service_attr_info *attr_info =
      (struct esp32_bt_service_attr_info *) calloc(na, sizeof(*attr_info));
  struct esp32_bt_service_attr_info *ai = attr_info;
  { /* Add primary service decl */
    if (!mgos_bt_uuid_from_str(mg_mk_str(svc_uuid), uuid)) {
      LOG(LL_ERROR, ("%s: Invalid svc UUID", svc_uuid));
      goto out;
    }
    dbe->attr_control.auto_rsp = ESP_GATT_AUTO_RSP;
    dbe->att_desc.uuid_length = ESP_UUID_LEN_16;
    dbe->att_desc.uuid_p = (uint8_t *) &primary_service_uuid;
    dbe->att_desc.perm = get_read_perm(sec_level);
    dbe->att_desc.max_length = uuid->len;
    dbe->att_desc.length = uuid->len;
    dbe->att_desc.value = (uint8_t *) &uuid->uuid;
    ai->handler = handler;
    ai->handler_arg = handler_arg;
    uuid++;
    ai++;
    dbe++;
  }
  for (cd = chars; cd->uuid != NULL; cd++) {
    if (!mgos_bt_uuid_from_str(mg_mk_str(cd->uuid), uuid)) {
      LOG(LL_ERROR, ("%s: %s: invalid char UUID", svc_uuid, cd->uuid));
      goto out;
    }
    { /* Add char decl */
      dbe->attr_control.auto_rsp = ESP_GATT_AUTO_RSP;
      dbe->att_desc.uuid_length = ESP_UUID_LEN_16;
      dbe->att_desc.uuid_p = (uint8_t *) &char_decl_uuid;
      dbe->att_desc.perm = get_read_perm(sec_level);
      dbe->att_desc.max_length = dbe->att_desc.length = 1;
      uint8_t cp = 0;
      if (cd->prop & MGOS_BT_GATT_PROP_READ) {
        cp |= ESP_GATT_CHAR_PROP_BIT_READ;
      }
      if (cd->prop & MGOS_BT_GATT_PROP_WRITE) {
        cp |= ESP_GATT_CHAR_PROP_BIT_WRITE;
        //| ESP_GATT_CHAR_PROP_BIT_WRITE_NR);
      }
      if (cd->prop & MGOS_BT_GATT_PROP_NOTIFY) {
        cp |= ESP_GATT_CHAR_PROP_BIT_NOTIFY;
      }
      if (cd->prop & MGOS_BT_GATT_PROP_INDICATE) {
        cp |= ESP_GATT_CHAR_PROP_BIT_INDICATE;
      }
      ai->char_prop = cp;
      dbe->att_desc.value = &ai->char_prop;
      dbe++;
      ai++;
    }
    { /* Add the char value attr */
      dbe->attr_control.auto_rsp = ESP_GATT_RSP_BY_APP;
      dbe->att_desc.uuid_length = uuid->len;
      dbe->att_desc.uuid_p = (uint8_t *) &uuid->uuid;
      if (cd->prop & MGOS_BT_GATT_PROP_READ) {
        dbe->att_desc.perm |= get_read_perm(sec_level);
      }
      if (cd->prop & MGOS_BT_GATT_PROP_WRITE) {
        dbe->att_desc.perm |= get_write_perm(sec_level);
      }
      ai->handler = cd->handler;
      ai->handler_arg = cd->handler_arg;
      uuid++;
      dbe++;
      ai++;
    }
    if (cd->prop & (MGOS_BT_GATT_PROP_NOTIFY | MGOS_BT_GATT_PROP_INDICATE)) {
      /* Add client config descriptor */
      dbe->attr_control.auto_rsp = ESP_GATT_RSP_BY_APP;
      dbe->att_desc.uuid_length = ESP_UUID_LEN_16;
      dbe->att_desc.uuid_p = (uint8_t *) &char_client_config_uuid;
      dbe->att_desc.perm = get_read_perm(sec_level) | get_write_perm(sec_level);
      se->num_cccds++;
      dbe++;
      ai++;
    }
  }
  se->attr_db = db;
  se->sec_level = sec_level;
  se->attr_info = attr_info;
  se->num_attrs = na;
  se->uuids = uuids;
  SLIST_INSERT_HEAD(&s_svcs, se, next);
  esp32_bt_register_services();
  res = true;
out:
  return res;
}

static void esp32_bt_gatts_send_resp(struct mgos_bt_gatts_conn *gsc,
                                     uint16_t handle, uint32_t trans_id,
                                     enum mgos_bt_gatt_status st) {
  struct esp32_bt_gatts_session_entry *sse =
      find_session(s_gatts_if, gsc->gc.conn_id, handle, NULL);
  if (sse == NULL) return;
  esp_gatt_status_t est = esp32_bt_gatt_get_status(st);
  esp_gatt_rsp_t rsp = {.handle = handle};
  LOG(LL_DEBUG, ("h %u tid %u st %d est %d", handle, trans_id, st, est));
  esp_ble_gatts_send_response(s_gatts_if, gsc->gc.conn_id, trans_id, est, &rsp);
}

void mgos_bt_gatts_send_resp_data(struct mgos_bt_gatts_conn *gsc,
                                  struct mgos_bt_gatts_read_arg *ra,
                                  struct mg_str data) {
  struct esp32_bt_gatts_session_entry *sse =
      find_session(s_gatts_if, gsc->gc.conn_id, ra->handle, NULL);
  if (sse == NULL) return;
  esp_gatt_rsp_t rsp = {
      .attr_value =
          {
           .handle = ra->handle,
           .offset = ra->offset,
           .len = data.len,
           .auth_req = ESP_GATT_AUTH_REQ_NONE,
          },
  };
  memcpy(rsp.attr_value.value, data.p, data.len);
  esp_ble_gatts_send_response(s_gatts_if, gsc->gc.conn_id, ra->trans_id,
                              ESP_GATT_OK, &rsp);
}

void mgos_bt_gatts_notify(struct mgos_bt_gatts_conn *gsc,
                          enum mgos_bt_gatt_notify_mode mode, uint16_t handle,
                          struct mg_str data) {
  if (gsc == NULL || mode == MGOS_BT_GATT_NOTIFY_MODE_OFF) return;
  struct esp32_bt_gatts_session_entry *sse =
      find_session(s_gatts_if, gsc->gc.conn_id, handle, NULL);
  if (sse == NULL) return false;
  struct esp32_bt_gatts_pending_ind *pi = calloc(1, sizeof(*pi));
  if (pi != NULL) {
    pi->handle = handle;
    pi->need_confirm = (mode == MGOS_BT_GATT_NOTIFY_MODE_INDICATE);
    pi->value = mg_strdup(data);
    STAILQ_INSERT_TAIL(&sse->ce->pending_inds, pi, next);
    sse->ce->ind_queue_len++;
  }
  esp32_bt_gatts_send_next_ind(sse->ce);
}

bool esp32_bt_gatts_init(void) {
  return (esp_ble_gatts_register_callback(esp32_bt_gatts_ev) == ESP_OK &&
          esp_ble_gatts_app_register(0) == ESP_OK);
}
